/*
 * @file            frontend/src/data/ganZhiData.js
 * @description     干支基础数据，包含阳干、阴干、阳支、阴支等基础数据
 * @author          Gordon <gordon_cao@qq.com>
 * @createTime      2026-02-19 15:35:00
 * @lastModified    2026-02-21 17:22:03
 * Copyright © All rights reserved
*/

export const YANG_GANS = ['甲', '丙', '戊', '庚', '壬']; // 定义阳干数组（甲、丙、戊、庚、壬）

export const YIN_GANS = ['乙', '丁', '己', '辛', '癸']; // 定义阴干数组（乙、丁、己、辛、癸）

export const YANG_ZHIS = ['子', '寅', '辰', '午', '申', '戌']; // 定义阳支数组（子、寅、辰、午、申、戌）

export const YIN_ZHIS = ['丑', '卯', '巳', '未', '酉', '亥']; // 定义阴支数组（丑、卯、巳、未、酉、亥）

export const ALL_GANS = [...YANG_GANS, ...YIN_GANS]; // 定义所有天干数组（阳干+阴干）

export const ALL_ZHIS = [...YANG_ZHIS, ...YIN_ZHIS]; // 定义所有地支数组（阳支+阴支）

export const xunTable = {
    '甲子': ['甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉'],
    '甲戌': ['甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未'],
    '甲申': ['甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳'],
    '甲午': ['甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯'],
    '甲辰': ['甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑'],
    '甲寅': ['甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥']
  };

  export const xunKongMap = {
    '甲子': ['戌', '亥'],
    '甲戌': ['申', '酉'],
    '甲申': ['午', '未'],
    '甲午': ['辰', '巳'],
    '甲辰': ['寅', '卯'],
    '甲寅': ['子', '丑']
  };